control_surfaces_sensitivity_toy/case_toy/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \\      /  F ield         |  OpenFOAM: The Open Source CFD Toolbox
|  \\    /   O peration     |  Version:  v2412
|   \\  /    A nd           |
|    \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

// Rotated bounding-box by +10 degrees about z-axis

vertices
(
    // z = 0 plane
    (-48.663  -69.185   0)   // 0
    ( 69.185  -48.663   0)   // 1
    ( 48.663   69.185   0)   // 2
    (-69.185   48.663   0)   // 3

    // z = 60 plane
    (-48.663  -69.185  60)   // 4
    ( 69.185  -48.663  60)   // 5
    ( 48.663   69.185  60)   // 6
    (-69.185   48.663  60)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (120 80 80) simpleGrading (5 1 3)
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 3 7 4));
    }

    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }

    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
            (0 1 2 3)
            (4 5 6 7)
        );
    }
);

mergePatchPairs();
