control_surfaces_sensitivity_toy/case_toy/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          6400;
        startFace       2278400;
    }
    outlet
    {
        type            patch;
        nFaces          6400;
        startFace       2284800;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          38400;
        startFace       2291200;
    }
)

// ************************************************************************* //
