control_surfaces_sensitivity_toy/case_toy/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType laminar;

// ************************************************************************* //
