control_surfaces_sensitivity_toy/case_toy/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \\      /  F ield         |  OpenFOAM: The Open Source CFD Toolbox
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel  Newtonian;

// Kinematic viscosity (air example)
nu              1e-5;

// ************************************************************************* //
