control_surfaces_sensitivity_toy/case_toy/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
|  \\    /   O peration     | Version:  v2412
|   \\  /    A nd           |
|    \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

// Free-stream internal field
internalField uniform (0 0 0);

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform (100 0 0);
    }

    outlet
    {
        type zeroGradient;
    }


    walls
    {
        type    slip;        // use slip to mimic inviscid external aero domain walls
    }

    senPam      // <-- fin surface created by snappy
    {
        type    noSlip;      // fin is solid
    }
}

// ************************************************************************* //
