control_surfaces_sensitivity_toy/case_toy/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
|  \\    /   O peration     | Version:  v2412
|   \\  /    A nd           |
|    \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];  

internalField uniform 101325;

boundaryField
{
    inlet
    {
        type zeroGradient;   // because U is fixed
    }

    outlet
    {
        type fixedValue;
        value uniform 101325;   // ambient static pressure
    }


    walls
    {
        type            zeroGradient;     // slip walls → no normal gradient of p
    }

    senPam
    {
        type            zeroGradient;     // solid fin
    }
}

// ************************************************************************* //
