control_surfaces_sensitivity_toy/case_toy/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \\      /  F ield         |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

// ---------------------------------------
// Time
// ---------------------------------------
ddtSchemes
{
    default         Euler;
}

// ---------------------------------------
// Gradients
// ---------------------------------------
gradSchemes
{
    default         Gauss linear;
}

// ---------------------------------------
// Divergence
// ---------------------------------------
divSchemes
{
    default         none;

    // slightly more diffusive than linearUpwind → more stable
    div(phi,U)      Gauss limitedLinear 1.0;
}

// ---------------------------------------
// Laplacian
// ---------------------------------------
laplacianSchemes
{
    default         Gauss linear corrected;
}

// ---------------------------------------
// Interpolation
// ---------------------------------------
interpolationSchemes
{
    default         linear;
}

// ---------------------------------------
// SnGrad
// ---------------------------------------
snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
