control_surfaces_sensitivity_toy/case_toy/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM: The Open Source CFD Toolbox
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 6;

method          scotch;
distributed     no;
roots           ();

// ************************************************************************* //
