control_surfaces_sensitivity_toy/case_toy/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \\      /  F ield         |  OpenFOAM: The Open Source CFD Toolbox
|  \\    /   O peration     |  Version:  v2412
|   \\  /    A nd           |
|    \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceFeatureExtractDict;
}

baseline.stl
{
    extractionMethod        extractFromSurface;

    extractFromSurfaceCoeffs
    {
        includedAngle       25;     // MUCH FINER (default was 150)
        geometricTest       yes;
    }

    writeObj                yes;
}

// ************************************************************************* //
